Revit 2027 API
RebarInSystem.MaxSpacing Property
 Identifies the maximum spacing between rebar in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaxSpacing { get; }
Public ReadOnly Property MaxSpacing As Double
	Get
public:
property double MaxSpacing {
	double get ();
}
member MaxSpacing : float with get
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace